function displayNumber() {
    let x = document.getElementById('inputnumber').value;
    let year = 2023 - x;
    document.getElementById('displayNumber').value = year + ' ♡ العمر كله';
    document.getElementById('boxMessage').innerText = 'استمتع باللحظة: لا تنسى أن تستمتع بالحياة وتقدر اللحظات الجميلة. امضِ وقتًا مع الأشخاص الذين تحبهم واستمتع بالهوايات التي تسترخيك وتسعدك.';

    if (year < 18){
document.getElementById('boxMessage').innerText = 'مرحبًا! أنت قاصر حاليًا وتعيش في مرحلة رائعة من الحياة. استغل هذه الفترة لاكتشاف مواهبك واهتماماتك، وتعلم المزيد من الأشياء واستمتع باللحظات الجميلة. قد تواجه تحديات ومسؤوليات جديدة، لكن لا تنسى أن تستمتع بطفولتك وتبني ذكريات قيّمة. استفد من الفرص التعليمية والاجتماعية والثقافية المتاحة لك، وضع خططًا لمستقبل مشرق. نحن نشجعك على التعلم والنمو وإظهار الإبداع الذي بداخلك. استمتع بالرحلة وكن فخورًا بمن تكون!"';
 }else if (year >= 18 && year < 25) {
    document.getElementById('boxMessage').innerText = "مرحبًا! أنت الآن في مرحلة مهمة من الحياة، حيث تجتاز مرحلة الشباب وتستكشف العالم بكل حماس وطموح. هذه الفترة هي فرصة للتعلم والنمو وتحقيق الأهداف الشخصية والمهنية. استغل هذه السنوات لاكتشاف مواهبك واهتماماتك، وتطوير مهاراتك، واستكشاف مجالات جديدة. قد تواجه تحديات وقرارات صعبة، ولكن لا تخف من تحديات الحياة، بل تعلم منها ونموذج من خلالها. ابنِ شبكات اجتماعية واكتسب صداقات جديدة وتواصل مع أشخاص ذوي اهتمامات مشتركة. استفد من الفرص التعليمية والتدريبية المتاحة، واستكشف مسارات مهنية مختلفة. حافظ على التوازن بين العمل والاسترخاء واستمتع باللحظات الجميلة في حياتك. تذكر أنك في بداية رحلتك وأمامك الكثير من الإمكانيات والفرص. نحن نشجعك على تحقيق أحلامك وبناء مستقبل مشرق. استعد للمغامرات واستمتع بالرحلة!"
    ;
  } else if (year >=25 && year < 35){
    document.getElementById('boxMessage').innerText = "مرحبًا! أنت الآن في مرحلة الشباب المبكرة، حيث تكون قد تحققت بعض الأهداف الشخصية والمهنية وتستمر في تطوير نفسك واستكشاف العالم. هذه الفترة هي فرصة للتحول والنمو وتحقيق الأحلام الكبيرة. قد تكون مشغولًا بالعمل وبناء حياتك المهنية، ولكن لا تنسَ أهمية الاستثمار في نفسك وصحتك الشخصية. استمر في تطوير مهاراتك وتوسيع معرفتك، سواء من خلال الدراسة أو الدورات التدريبية أو التجارب العملية. استفد من تجارب الحياة واستمتع باللحظات الجميلة مع الأصدقاء والعائلة. قد تواجه تحديات وقرارات صعبة في هذه المرحلة، لكن ثق في قدراتك واعتمد على الخبرات التي اكتسبتها حتى الآن. حافظ على التوازن بين العمل والحياة الشخصية واهتم بصحتك العقلية والجسدية. لا تخف من المغامرة واستكشف فرصًا جديدة وتحدى نفسك لتحقيق أهداف أكبر. نحن نشجعك على الاستمرار في بناء حياة مليئة بالمعنى والتحقيقات والسعادة. استعد لمستقبل مشرق واستمتع بالرحلة!";

  } else if (year >=35 && year < 50){
    document.getElementById('boxMessage').innerText = "مرحبًا! أنت الآن في مرحلة النضج والاستقرار، حيث قد تكون قد بنيت أساسًا قويًا في الحياة وتعيش تحت تأثير التجارب والتحديات التي مررت بها. هذه الفترة هي فرصة للاستفادة من الخبرات التي اكتسبتها وتحقيق الاستقرار الشخصي والمهني. قد تكون مشغولًا بمسؤوليات العمل والأسرة، لكن لا تنسَ أهمية الاستمتاع بالحياة والاهتمام بصحتك الشاملة. استغل هذه الفترة لتحقيق الأهداف الشخصية التي لم تحققها بعد، واستكشاف شغفك واهتماماتك الجديدة. كن داعمًا لنفسك وللآخرين من حولك، واستمتع بالوقت مع الأصدقاء والعائلة. حافظ على التوازن بين العمل والحياة الشخصية واستكشف فرصًا جديدة للنمو والتحسين. قد تواجه تحديات في هذه المرحلة من الحياة، لكن ثق في قدراتك واستخدم الحكمة والخبرة التي اكتسبتها للتغلب عليها. نحن نشجعك على الاستمرار في السعي إلى التحقيق والتطوير الشخصي. ابتسم واستعد لمستقبل مليء بالإمكانات والإنجازات الجديدة. استمتع بكل لحظة في رحلتك الشخصية والمهنية!";

  }
  else if (year >=10 && year < 17) {
    document.getElementById('boxMessage').innerText = 'أنت قادر على تحقيق كل ما تطمح إليه في حياتك!';
  }
  }
